// From gen_dict.js
const dict = {
  a: "阿啊呵腌嗄吖锕爱埃艾碍癌哀挨矮安案按岸暗鞍氨俺昂仰盎肮奥澳傲熬凹鳌敖遨",
  e: "额阿俄恶鹅遏鄂厄诶恩摁蒽而二尔儿耳迩饵洱",
  x:
    "系西席息希习吸喜现先县见线限显险新心信辛欣薪馨鑫学血雪削薛穴靴谑修秀休宿袖绣臭朽需许续须序徐休蓄些解协写血叶谢械下夏峡厦辖霞夹虾讯训迅孙寻询循旬向项相想乡象响香小效销消校晓笑肖县选宣券旋悬轩喧行省星腥猩惺兴刑雄兄熊胸凶匈汹芎",
  y:
    "一以已意议义益亿于与育余预域予遇元员院原源远愿园研严验演言眼烟沿有由又优游油友右要么约药邀摇耀腰业也夜叶射野液冶月说约越乐跃兑阅亚压雅牙押鸭呀轧应营影英景迎映硬员运云允孕蕴韵酝因引银印音饮阴隐样养央阳洋扬杨羊哟唷用永拥勇涌泳庸俑",
  h:
    "厂汉韩含旱寒汗涵和活或货获火伙惑会回挥汇惠辉恢徽和合河何核盖贺喝和护许户核湖互乎哈蛤铪海还害孩亥咳骸骇行航杭巷夯吭桁沆红宏洪轰虹鸿弘哄好号毫豪耗浩郝皓很狠恨痕哏婚混魂浑昏棍珲荤黑嘿嗨衡横恒亨哼珩桁蘅后候厚侯猴喉吼逅化华划话花画滑哗怀坏淮徊槐踝还环换欢患缓唤焕黄荒煌皇凰慌晃潢",
  w:
    "瓦挖娃洼袜蛙凹哇为位委未维卫围违务物无五武午吴舞我握窝沃卧挝涡斡万完晚湾玩碗顽挽文问闻稳温纹吻蚊外歪崴王望往网忘亡旺汪翁嗡瓮蓊蕹",
  n:
    "牛纽扭钮拗妞忸狃年念酿辗碾廿捻撵嗯唔呢哪呐讷疒能乃奶耐奈鼐萘氖南难男楠喃囡赧腩农浓弄脓侬哝内南那纳拿哪娜钠内那哪馁难诺挪娜糯懦傩喏囊馕囔曩攮脑闹恼挠瑙淖孬垴你尼呢泥疑拟逆倪嫩恁能您恁鸟尿溺袅脲茑嬲摄聂捏涅镍孽捻蘖娘酿宁凝拧泞柠咛狞佞努怒奴弩驽帑孥胬女钕衄恧暖虐疟耨",
  o: "哦噢喔区欧偶殴呕禺藕讴",
  b:
    "把八巴拔伯吧坝爸比必币笔毕秘避闭百白败摆伯拜柏佰波博播勃拨薄佛伯北被备倍背杯勃贝办版半班般板颁伴份宾频滨斌彬濒殡帮邦彭旁榜棒膀镑泵崩蚌蹦迸绷甭嘣报保包宝暴胞薄爆不部步布补捕堡埔本体奔苯笨夯贲锛变便边编遍辩鞭辨表标彪镖裱飚膘飙别鳖憋瘪蹩并病兵冰屏饼炳秉",
  p:
    "怕帕爬扒趴琶啪葩被批副否皮坏辟啤判盘番潘攀盼拚畔旁庞乓磅螃彷滂逄普暴铺浦朴堡葡谱破繁坡迫颇朴泊婆便片篇偏骗翩扁骈票朴漂飘嫖瓢剽缥配培坏赔佩陪沛裴平评凭瓶冯屏萍苹牌排派拍迫徘湃俳鹏朋彭膨蓬碰苹棚跑炮泡抛刨袍咆疱剖掊裒喷盆湓瞥撇苤氕丿品贫聘频拼拚颦姘",
  m:
    "面棉免绵缅勉眠冕民敏闽闵皿泯岷悯万没么模末冒莫摩目模木亩幕母牧莫贸毛矛冒貌茂茅帽么马吗摩麻码妈玛么麽买卖麦迈脉埋霾荬满慢曼漫埋蔓瞒蛮米密秘迷弥蜜谜觅们门闷瞒汶扪焖懑忙盲茫芒氓莽蟒邙蒙盟梦猛孟萌氓朦苗秒妙描庙瞄缪渺某谋牟缪眸哞鍪蛑缪谬美没每煤梅媒枚妹灭蔑篾乜咩蠛明名命鸣铭冥茗溟",
  f:
    "反范犯繁饭泛翻凡府服副负富复福夫风丰封峰奉凤锋冯分份纷奋粉氛芬愤方放房防访纺芳仿不否缶发法罚乏伐阀筏砝费非飞肥废菲肺啡佛",
  z:
    "镇真针圳振震珍阵藏脏葬赃臧奘驵责则泽择侧咋啧仄债择齐宅寨侧摘窄查扎炸诈闸渣咋乍资自子字齐咨滋仔展战占站崭粘湛沾长张章障涨掌帐胀着照招找召朝赵兆调州周洲舟骤轴昼制之治质职只志至政正证争整征郑丁追坠缀揣椎锥赘惴专转传赚砖撰篆馔装状庄壮撞妆幢桩准屯淳谆肫窀组族足祖租阻卒俎总从综宗纵踪棕粽作做座左坐昨佐琢钻纂攥缵躜主术住注助属逐宁这者着著浙折哲蔗中重种众终钟忠仲着著缴桌卓捉琢灼最罪嘴醉咀蕞觜赞暂攒堑昝簪糌瓒抓挝爪杂扎咱砸咋匝咂拶在再灾载栽仔宰哉造早遭枣噪灶燥糟贼怎谮增曾综赠憎锃甑罾这走邹奏揍诹驺陬楱转拽尊遵鳟樽撙",
  g:
    "更耕颈庚耿梗埂羹夹咖嘎尬噶旮伽尕个合各革格歌哥盖改该盖概溉钙丐芥干感赶敢甘肝杆赣港钢刚岗纲冈杠缸工公共供功红贡攻广光逛潢犷胱咣桄高告搞稿膏糕镐皋给根跟亘艮哏茛构购够句沟狗钩拘股古顾故固鼓骨估括挂瓜刮寡卦呱褂怪拐乖关管观馆官贯冠惯规贵归轨桂柜圭鬼滚棍辊衮磙鲧绲丨国过果郭锅裹帼涡",
  c:
    "拆擦嚓礤查察差茶插叉刹茬才采财材菜彩裁蔡参残餐灿惨蚕掺璨参岑涔藏仓苍沧舱臧伧称陈沈沉晨琛臣尘草操曹槽糙嘈漕螬策测册侧厕栅恻层曾蹭噌差拆柴钗豺侪虿瘥次此差词辞刺瓷磁措错磋挫搓撮蹉锉产单阐崭缠掺禅颤场长厂常偿昌唱畅超朝潮炒钞抄巢吵车彻撤尺扯澈掣坼成程城承称盛抢乘持吃池迟赤驰尺斥揣踹啜搋膪重种充冲涌崇虫宠筹抽绸酬愁丑臭仇出处础初助除储畜传川船穿串喘椽舛窜攒篡蹿撺爨汆镩创床窗闯幢疮怆吹垂锤炊椎陲槌捶春纯醇淳唇椿蠢鹑促趋趣粗簇醋卒蹴辍绰戳淖啜龊踔辶从丛匆聪葱囱琮淙凑辏腠楱衰催崔脆翠萃粹摧村存寸忖皴",
  s:
    "信深参身神什审申三参散伞叁糁馓毵山单善陕闪衫擅汕生声升胜盛乘圣剩是时实事市十使世设社摄涉射折舍蛇司四思斯食私死似算酸蒜狻随岁虽碎尿隧遂髓双爽霜孀泷术书数属树输束述率衰帅摔甩蟀色塞瑟涩啬穑铯槭少绍召烧稍邵哨韶扫骚嫂梢缫搔瘙臊沙厦杀纱砂啥莎刹萨洒撒飒卅仨脎所些索缩锁莎梭琐思赛塞腮噻鳃说水税谁睡氵桑丧嗓搡颡磉森僧筛晒上商尚伤赏汤裳墒收手受首售授守寿说数硕烁朔铄妁槊速素苏诉缩塑肃俗刷耍唰栓拴涮闩顺瞬舜吮送松宋讼颂耸诵嵩艘搜擞嗽嗖叟馊薮损孙笋荪榫隼狲飧",
  d:
    "到道导岛倒刀盗稻等登邓灯澄凳瞪蹬多度夺朵躲铎隋咄吨顿盾敦蹲墩囤沌大达打答搭沓瘩惮大代带待贷毒戴袋但单石担丹胆旦弹当党档荡挡宕砀铛的地得德底锝得的地第提低底抵弟电点店典奠甸碘淀调掉雕吊钓刁貂凋跌叠蝶迭碟爹谍牒定订顶丁鼎盯钉锭丢铥动东董冬洞懂冻栋都斗读豆抖兜陡逗度都独督读毒渡杜断段短端锻缎煅椴对队追敦兑堆碓镦嗲",
  l:
    "联连练廉炼脸莲恋路六陆录绿露鲁卢理力利立里李历例落罗络洛逻螺锣骆乱卵滦峦鸾栾銮挛拉落垃腊啦辣蜡喇来莱赖睐徕籁涞赉兰览蓝篮栏岚烂滥林临邻赁琳磷淋麟浪朗郎廊狼琅榔螂量两粮良辆亮梁凉老劳落络牢捞涝烙了乐勒肋叻鳓嘞仂类累雷勒泪蕾垒磊列烈劣裂猎冽咧趔冷愣棱楞塄领令另零灵龄陵岭俩了料疗辽廖聊寥缪流刘六留柳瘤硫溜论轮伦仑纶沦抡囵率律旅绿虑履吕铝楼露漏陋娄搂篓喽龙隆弄垄笼拢聋陇略掠锊",
  j:
    "车局据具举且居剧济机其技基记计系家结解价界接节她将强江港奖讲降疆家加价假佳架甲嘉军均俊君峻菌竣钧窘炯迥炅冂扃决绝角觉掘崛诀獗建间件见坚检健监教交较校角觉叫脚进金今近仅紧尽津经京精境竞景警竟就究九酒久救旧纠卷捐圈眷娟倦绢隽",
  r:
    "容荣融绒溶蓉熔戎人任认仁忍韧刃纫瑞兑锐睿芮蕊蕤蚋若弱偌箬入如女乳儒辱汝茹热若惹喏然染燃冉苒髯蚺让壤攘嚷瓤穰禳绕扰饶娆桡荛仍扔日肉柔揉糅鞣蹂软阮朊润闰",
  t:
    "堂唐糖汤塘躺趟倘托脱拓拖妥驼陀沱团揣湍疃抟彖大台太态泰抬胎汰他它她拓塔踏塌榻谈探坦摊弹炭坛滩套讨跳陶涛逃桃萄条调挑跳迢眺苕窕特忑忒铽慝体提题弟替梯踢惕推退弟腿褪颓蜕忒天田添填甜甸恬腆听庭停厅廷挺亭艇同通统童痛铜桶桐吞屯囤褪豚臀饨暾投头透偷愉骰亠腾疼藤滕誊铁贴帖餮萜土突图途徒涂吐屠",
  q:
    "企其起期气七器汽求球秋丘邱仇酋裘区去取曲趋渠趣驱全权券泉圈拳劝犬穷琼穹邛茕筇跫蛩卡恰洽掐髂袷咭葜切且契窃茄砌锲怯前千钱签潜迁欠纤强抢疆墙枪腔锵呛桥乔侨巧悄敲俏壳亲勤侵秦钦琴禽芹群裙逡麇确却缺雀鹊阙瘸榷情青清请亲轻庆倾",
  k:
    "可科克客刻课颗渴口扣寇叩抠佝蔻芤会快块筷脍蒯侩浍看刊勘堪坎砍侃嵌开凯慨岂楷恺揩锴卡喀咖咔咯佧胩康抗扛慷炕亢糠伉坑铿吭考靠烤拷铐栲尻犒肯垦恳啃龈裉空控孔恐倥崆箜苦库哭酷裤枯窟挎跨夸垮挎胯侉亏奎愧魁馈溃匮葵款宽髋况矿框狂旷眶匡筐困昆坤捆琨锟鲲醌扩括阔廓蛞",
};

function combination(s) {
  const arr = [];

  function rec(current_s, s) {
    if (current_s.length === s.length) {
      arr.push(current_s);
      return;
    }
    const c = s[current_s.length];
    const candidates = dict[c];
    for (const candidate of candidates) {
      rec(current_s + candidate, s);
    }
  }

  rec("", s);
  return arr;
}

export default (req, res) => {
  const {
    query: { q },
  } = req;
  res.statusCode = 200;
  res.json(combination(q));
};
